examples/single_turbine_kefp/8cD/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions:
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allclean

runApplication blockMesh

runApplication touch test.foam

#------------------------------------------------------------------------------
